000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/ПодборПоТоварнымКатегориям/ПодборПоТоварнымКатегориям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПодборПоТоварнымКатегориям</name>
</mdclass:DataProcessor>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КвотыАссортимента/КвотыАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КвотыАссортимента</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Квота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтклонения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПланирования</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Марка</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/Ассортимент/Ассортимент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Ассортимент</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РольАссортимента</name>
    <type>
      <types>EnumRef.РолиАссортимента</types>
    </type>
  </resources>
  <resources>
    <name>РазрешеныЗакупки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешеныПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПланирования</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ОперацииИзмененияАссортимента/ОперацииИзмененияАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииИзмененияАссортимента</name>
  <enumValues>
    <name>ВводВАссортимент</name>
  </enumValues>
  <enumValues>
    <name>ВводВАссортиментСОтсрочкойНачалаПродаж</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСостоянияАссортимента</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзАссортимента</name>
  </enumValues>
  <enumValues>
    <name>ПереносВАрхивОтзыв</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтадииАссортимента/СтадииАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтадииАссортимента</name>
  <enumValues>
    <name>РазрешеныТолькоЗакупки</name>
  </enumValues>
  <enumValues>
    <name>РазрешеныЗакупкиИПродажи</name>
  </enumValues>
  <enumValues>
    <name>РазрешеныТолькоПродажи</name>
  </enumValues>
  <enumValues>
    <name>ЗапрещеныЗакупкиИПродажи</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>IDNG</name>
    <comment>IDN группы. Служебный реквизит</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEB_АвторепрайсЦен</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WEB_Выгружать</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WEB_МониторингЦен</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Весовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.БазовыеЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <comment>Использовать серийные номера (подарочные сертификаты)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИзменения</name>
    <comment>NAV: timestamp</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоУКТЗЕД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маржинальность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТовара</name>
    <type>
      <types>EnumRef.НазначенияТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Новинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НовинкаДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСерийногоНомера</name>
    <type>
      <types>EnumRef.ТипыСерийныхНомеровСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСрокаДействия</name>
    <type>
      <types>EnumRef.СрокДействияПодарочныхСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОбычныйЦенник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Эксклюзив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/ПодборПоТоварнымКатегориям/Forms/ПодборПоКатегориям/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеКолонкиНоменклатуры = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ДополнительнаяКолонкаПриОтображенииНоменклатуры");
	
	ОбъектПланирования = Параметры.ОбъектПланирования;
	Операция = Параметры.Операция;
	Стадия = Параметры.Стадия;
	ДатаНачалаДействия = Параметры.ДатаНачалаДействия;
	
	СохраненныеНастройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПодборТоваровПоКатегориямНастройкиФормы");
	Если СохраненныеНастройки = Неопределено Тогда
		ПоказыватьПодобранныеТовары = Истина;
	Иначе
		Если СохраненныеНастройки.Свойство("ПоказыватьПодобранныеТовары") Тогда
			ПоказыватьПодобранныеТовары = СохраненныеНастройки.ПоказыватьПодобранныеТовары;
		КонецЕсли;
	КонецЕсли;
	
	ОтборыСписковКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаТоваров, "НаДату", ДатаНачалаДействия, Истина);
	ОтборыСписковКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаТоваров, "ОбъектПланирования", ОбъектПланирования, Истина);
	
	Если Параметры.ФормироватьДеревоПриОткрытии Тогда
		СформироватьДеревоКатегорийСервер();
	КонецЕсли;
	
	Элементы.ТаблицаВыбранныхТоваров.Видимость = ПоказыватьПодобранныеТовары;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьИнформационнуюНадписьКоличестваТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ ПеренестиВДокумент И ТаблицаВыбранныхТоваров.Количество() > 0 Тогда
		ТекстВопроса=НСтр("ru='Перенести выбранные позиции в документ?'");
		Ответ=Вопрос(ТекстВопроса,РежимДиалогаВопрос.ДаНетОтмена);
		Если Ответ=КодВозвратаДиалога.Да Тогда
			ПеренестиВДокумент=Истина;
		ИначеЕсли Ответ=КодВозвратаДиалога.Отмена Тогда
			Отказ=Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ПоказыватьПодобранныеТовары",     ПоказыватьПодобранныеТовары);
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("ПодборТоваровПоКатегориямНастройкиФормы",,ПараметрыЗакрытия);
	
	Если ПеренестиВДокумент Тогда
		СтруктураАдресов = ПоместитьТоварыВХранилище();
		ОповеститьОВыборе(СтруктураАдресов);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ПоказыватьПодобранныеТоварыПриИзменении(Элемент)
	Элементы.ТаблицаВыбранныхТоваров.Видимость=ПоказыватьПодобранныеТовары;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ <Таблица товаров>

&НаКлиенте
Процедура ТаблицаТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТаблицы=Элемент.ТекущиеДанные;
	Если СтрокаТаблицы <> Неопределено Тогда
		//
		УжеВыбрано=Ложь;
		СтруктураПоиска=Новый Структура("Номенклатура",СтрокаТаблицы.Номенклатура);
		МассивНайденных=ТаблицаВыбранныхТоваров.НайтиСтроки(СтруктураПоиска);
		Если МассивНайденных.Количество()>0 Тогда
			УжеВыбрано=Истина;
		КонецЕсли;
		Если НЕ УжеВыбрано Тогда
				Если Операция = ПредопределенноеЗначение("Перечисление.ОперацииИзмененияАссортимента.ВыводИзАссортимента")
					ИЛИ Операция = ПредопределенноеЗначение("Перечисление.ОперацииИзмененияАссортимента.ПереносВАрхивОтзыв") Тогда
					
					Если (СтрокаТаблицы.СтадияАссортимента = Стадия
						ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицы.СтадияАссортимента)) Тогда
						Ответ = Вопрос("Данный товар уже выведен из ассортимента."+Символы.ПС
						+"Добавление его в документ не требуется."+Символы.ПС
						+"Продолжить?",РежимДиалогаВопрос.ДаНет);
						Если Ответ <> КодВозвратаДиалога.Да Тогда
							Возврат;
						КонецЕсли;
					КонецЕсли;
					
				Иначе
					
					Если СтрокаТаблицы.СтадияАссортимента = Стадия
						И Операция <> ПредопределенноеЗначение("Перечисление.ОперацииИзмененияАссортимента.ИзменениеСостоянияАссортимента") Тогда
						Ответ = Вопрос("Данный товар уже находится в стадии "+СтрокаТаблицы.СтадияАссортимента+"."+Символы.ПС
						+"Добавление его в документ не требуется."+Символы.ПС
						+"Продолжить?",РежимДиалогаВопрос.ДаНет);
						Если Ответ <> КодВозвратаДиалога.Да Тогда
							Возврат;
						КонецЕсли;
					КонецЕсли;
					МаркаОтбора = ?(СтрокаТаблицы.Марка="Прочие марки",
										ПредопределенноеЗначение("Справочник.Марки.ПустаяСсылка"),
										СтрокаТаблицы.Марка);
					Квота = КвотаКатегории(ОбъектПланирования,
											СтрокаТаблицы.ТоварнаяКатегория,
											МаркаОтбора,
											ДатаНачалаДействия);
					Если Квота=0 Тогда // и еще вопрос...
						СтрокаМарка="";
						Если ЗначениеЗаполнено(МаркаОтбора) Тогда
							СтрокаМарка = ""+Символы.ПС+" и марке """ + СокрЛП(МаркаОтбора)+""""+Символы.ПС;
						КонецЕсли;
						Ответ = Вопрос("По товарной категории """+СтрокаТаблицы.ТоварнаяКатегория+СтрокаМарка+""" не установлена квота."+Символы.ПС
						+"Присутствие данного товара в ассортименте"+Символы.ПС
						+"противоречит ассортиментной политике."+Символы.ПС
						+"Продолжить?",РежимДиалогаВопрос.ДаНет);
						Если Ответ <> КодВозвратаДиалога.Да Тогда
							Возврат;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			НоваяСтрока=ТаблицаВыбранныхТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы);
			ОбновитьНаполнениеСУчетомПодбораВДереве(НоваяСтрока.ПолучитьИдентификатор(), 1);
			ЭтотОбъект.Модифицированность=Истина;
			//
			ТаблицаВыбранныхТоваровПриИзменении();
			Если Не ПоказыватьПодобранныеТовары Тогда
				
				ТекстСобытия = НСтр("ru = 'Товар добавлен в таблицу подбора'");
				ТекстОповещения = НСтр("ru = 'Товар %%Товар%% добавлен в таблицу подбора'");
				ТекстОповещения = СтрЗаменить(ТекстОповещения, "%%Товар%%", Строка(СтрокаТаблицы.Номенклатура));
				
				ПоказатьОповещениеПользователя(ТекстСобытия, ,ТекстОповещения);
				
			КонецЕсли;
		Иначе
			ТекстСобытия = НСтр("ru = 'Товар уже присутствует в таблице подбора'");
			ТекстОповещения = НСтр("ru = 'Товар %%Товар%% уже присутствует в таблице подбора'");
			ТекстОповещения = СтрЗаменить(ТекстОповещения, "%%Товар%%", Строка(СтрокаТаблицы.Номенклатура));
			
			ПоказатьОповещениеПользователя(ТекстСобытия, ,ТекстОповещения);
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровПередНачаломИзменения(Элемент, Отказ)
	Отказ=Истина;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ <дерево категорий>

&НаКлиенте
Процедура ДеревоКатегорийПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("УстановитьОтборПоТекущейСтрокеДереваОбработчикОжидания", 0.2, Истина);
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ <Таблица выбранных товаров>

&НаКлиенте
Процедура ТаблицаВыбранныхТоваровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбранныхТоваровПередУдалением(Элемент, Отказ)
	
	ТекущаяУдаляемаяСтрока = Элементы.ТаблицаВыбранныхТоваров.ТекущиеДанные;
	Если ТекущаяУдаляемаяСтрока <> Неопределено Тогда
		ОбновитьНаполнениеСУчетомПодбораВДереве(ТекущаяУдаляемаяСтрока.ПолучитьИдентификатор(), -1);
		Элементы.ДеревоКатегорий.ТекущаяСтрока = 2;
		ОбновитьИнформационнуюНадписьКоличестваТоваров();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПеренестиВДокумент = Истина;
	Закрыть();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ТаблицаВыбранныхТоваровПриИзменении()
	
	ОбновитьИнформационнуюНадписьКоличестваТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоТекущейСтрокеДереваОбработчикОжидания()
	ТекущаяСтрокаДерева=Элементы.ДеревоКатегорий.ТекущиеДанные;
	ТаблицаТоваров.Отбор.Элементы.Очистить();
	Если ТекущаяСтрокаДерева=Неопределено Тогда
	Иначе
		Если ТипЗнч(ТекущаяСтрокаДерева.ВидКатегорияМарка)=Тип("СправочникСсылка.ВидыНоменклатуры") Тогда
			Если ТекущаяСтрокаДерева.ЭтоГруппаВидов Тогда
				ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
					ТаблицаТоваров,
					"ОтборВидНоменклатуры",
					ТекущаяСтрокаДерева.ВидКатегорияМарка,
					Истина,
					ВидСравненияКомпоновкиДанных.ВИерархии
				);
			Иначе
				ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
					ТаблицаТоваров,
					"ОтборВидНоменклатуры",
					ТекущаяСтрокаДерева.ВидКатегорияМарка,
					Истина,
					ВидСравненияКомпоновкиДанных.Равно
				);
			КонецЕсли;
		ИначеЕсли ТипЗнч(ТекущаяСтрокаДерева.ВидКатегорияМарка)=Тип("СправочникСсылка.ТоварныеКатегории") Тогда
			Если ТекущаяСтрокаДерева.ЭтоГруппаКатегорий Тогда
				ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
					ТаблицаТоваров,
					"ОтборТоварнаяКатегория",
					ТекущаяСтрокаДерева.ВидКатегорияМарка,
					Истина,
					ВидСравненияКомпоновкиДанных.ВИерархии
				);
			Иначе
				ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
					ТаблицаТоваров,
					"ОтборТоварнаяКатегория",
					ТекущаяСтрокаДерева.ВидКатегорияМарка,
					Истина,
					ВидСравненияКомпоновкиДанных.Равно
				);
			КонецЕсли;
		ИначеЕсли ТипЗнч(ТекущаяСтрокаДерева.ВидКатегорияМарка)=Тип("СправочникСсылка.Марки")
			ИЛИ ТипЗнч(ТекущаяСтрокаДерева.ВидКатегорияМарка)=Тип("Строка") Тогда
			РодительСтрокиДерева=ТекущаяСтрокаДерева.ПолучитьРодителя();
			Если РодительСтрокиДерева<>Неопределено Тогда
				ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
					ТаблицаТоваров,
					"ОтборТоварнаяКатегория",
					РодительСтрокиДерева.ВидКатегорияМарка,
					Истина,
					ВидСравненияКомпоновкиДанных.Равно
				);
			КонецЕсли;
			ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
				ТаблицаТоваров,
				"ОтборМарка",
				ТекущаяСтрокаДерева.ВидКатегорияМарка,
				Истина,
				ВидСравненияКомпоновкиДанных.Равно
			);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоКатегорийСервер()
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Квоты.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|	Квоты.Марка КАК Марка,
	|	Квоты.Квота КАК Квота,
	|	Квоты.ПроцентОтклонения КАК ПроцентОтклонения
	|ПОМЕСТИТЬ втПланКатегории
	|ИЗ
	|	РегистрСведений.КвотыАссортимента.СрезПоследних(&НаДату, ОбъектПланирования = &ОбъектПланирования) КАК Квоты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФорматыМагазинов КАК Форматы
	|		ПО Квоты.ОбъектПланирования = Форматы.Ссылка
	|			И (Квоты.Период В
	|				(ВЫБРАТЬ
	|					МАКСИМУМ(К.Период)
	|				ИЗ
	|					РегистрСведений.КвотыАссортимента КАК К
	|				ГДЕ
	|					К.Период <= &НаДату
	|					И К.ОбъектПланирования = &ОбъектПланирования))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНоменклатура.Ссылка КАК Номенклатура,
	|	СправочникНоменклатура.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|	СправочникНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ЕСТЬNULL(ПланКатегории.Марка, ЗНАЧЕНИЕ(Справочник.Марки.ПустаяСсылка)) КАК Марка,
	|	ЕСТЬNULL(ПланКатегории.Квота, 0) КАК Квота,
	|	Ассортимент.Номенклатура КАК НоменклатураНаполнения,
	|	ЕСТЬNULL(Ассортимент.РольАссортимента, ЗНАЧЕНИЕ(Перечисление.РолиАссортимента.ПустаяСсылка)) КАК РольАссортимента,
	|	ЕСТЬNULL(Ассортимент.РазрешеныЗакупки, ЛОЖЬ) КАК РазрешеныЗакупки,
	|	ЕСТЬNULL(Ассортимент.РазрешеныПродажи, ЛОЖЬ) КАК РазрешеныПродажи,
	|	Ассортимент.ВидЦен КАК ВидЦен
	|ПОМЕСТИТЬ втТекущийАссортимент
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Ассортимент.СрезПоследних(КОНЕЦПЕРИОДА(&НаДату, ДЕНЬ), ОбъектПланирования = &ОбъектПланирования) КАК Ассортимент
	|		ПО (Ассортимент.Номенклатура = СправочникНоменклатура.Ссылка)
	|			И (Ассортимент.РазрешеныЗакупки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПланКатегории КАК ПланКатегории
	|		ПО (ПланКатегории.ТоварнаяКатегория = СправочникНоменклатура.ТоварнаяКатегория)
	|			И (ПланКатегории.Марка = СправочникНоменклатура.Марка)
	|ГДЕ
	|	НЕ СправочникНоменклатура.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущийАссортимент.ВидНоменклатуры,
	|	ТекущийАссортимент.ТоварнаяКатегория,
	|	ТекущийАссортимент.Марка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТекущийАссортимент.Номенклатура) КАК ВсегоНоменклатурыВКатегории,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТекущийАссортимент.НоменклатураНаполнения) КАК НаполнениеКатегории
	|ПОМЕСТИТЬ втИтогиПоКатегориям
	|ИЗ
	|	втТекущийАссортимент КАК ТекущийАссортимент
	|
	|СГРУППИРОВАТЬ ПО
	|	ТекущийАссортимент.ВидНоменклатуры,
	|	ТекущийАссортимент.ТоварнаяКатегория,
	|	ТекущийАссортимент.Марка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущийАссортимент.ВидНоменклатуры,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТекущийАссортимент.Номенклатура) КАК ВсегоНоменклатурыВКатегории,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТекущийАссортимент.НоменклатураНаполнения) КАК НаполнениеКатегории
	|ПОМЕСТИТЬ втИтогиПоВидам
	|ИЗ
	|	втТекущийАссортимент КАК ТекущийАссортимент
	|
	|СГРУППИРОВАТЬ ПО
	|	ТекущийАссортимент.ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тКатегории.ВидНоменклатуры КАК ВидНоменклатуры,
	|	тКатегории.ВидНоменклатуры.Наименование КАК НаименованиеВидаНоменклатуры,
	|	тКатегории.ВидНоменклатуры.ЭтоГруппа КАК ЭтоГруппаВидов,
	|	тКатегории.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|	ЕСТЬNULL(тКатегории.ТоварнаяКатегория.Наименование, &ПустаяКатегория) КАК НаименованиеКатегории,
	|	ЕСТЬNULL(тКатегории.ТоварнаяКатегория.ЭтоГруппа, ЛОЖЬ) КАК ЭтоГруппаКатегорий,
	|	тКатегории.Марка КАК Марка,
	|	тКатегории.НаименованиеМарки КАК НаименованиеМарки,
	|	тКатегории.Квота КАК Квота,
	|	тКатегории.ПроцентОтклонения КАК ПроцентОтклонения,
	|	ИтогиПоКатегориям.ВсегоНоменклатурыВКатегории КАК ВсегоНоменклатуры,
	|	ИтогиПоВидам.ВсегоНоменклатурыВКатегории КАК ВсегоНоменклатурыВВиде,
	|	ИтогиПоКатегориям.НаполнениеКатегории КАК Наполнение,
	|	ИтогиПоВидам.НаполнениеКатегории КАК НаполнениеВВиде
	|ИЗ
	|	(ВЫБРАТЬ
	|		СправочникВиды.Ссылка КАК ВидНоменклатуры,
	|		ЕСТЬNULL(СправочникКатегории.Ссылка, ЗНАЧЕНИЕ(Справочник.ТоварныеКатегории.ПустаяСсылка)) КАК ТоварнаяКатегория,
	|		ЕСТЬNULL(ПланКатегории.Марка, ЗНАЧЕНИЕ(Справочник.Марки.ПустаяСсылка)) КАК Марка,
	|		ЕСТЬNULL(ПланКатегории.Марка.Наименование, ""Прочие марки"") КАК НаименованиеМарки,
	|		ЕСТЬNULL(ПланКатегории.Квота, 0) КАК Квота,
	|		ЕСТЬNULL(ПланКатегории.ПроцентОтклонения, 0) КАК ПроцентОтклонения
	|	ИЗ
	|		Справочник.ВидыНоменклатуры КАК СправочникВиды
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТоварныеКатегории КАК СправочникКатегории
	|			ПО СправочникВиды.Ссылка = СправочникКатегории.Владелец
	|				И (НЕ СправочникКатегории.ЭтоГруппа)
	|			ЛЕВОЕ СОЕДИНЕНИЕ втПланКатегории КАК ПланКатегории
	|			ПО (СправочникКатегории.Ссылка = ПланКатегории.ТоварнаяКатегория)
	|	ГДЕ
	|		НЕ СправочникВиды.ЭтоГруппа) КАК тКатегории
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИтогиПоКатегориям КАК ИтогиПоКатегориям
	|		ПО тКатегории.ТоварнаяКатегория = ИтогиПоКатегориям.ТоварнаяКатегория
	|			И тКатегории.ВидНоменклатуры = ИтогиПоКатегориям.ВидНоменклатуры
	|			И тКатегории.Марка = ИтогиПоКатегориям.Марка
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИтогиПоВидам КАК ИтогиПоВидам
	|		ПО тКатегории.ВидНоменклатуры = ИтогиПоВидам.ВидНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеВидаНоменклатуры,
	|	НаименованиеКатегории,
	|	НаименованиеМарки
	|ИТОГИ
	|	МАКСИМУМ(НаименованиеМарки),
	|	СУММА(Квота),
	|	0 КАК ПроцентОтклонения,
	|	СУММА(ВсегоНоменклатуры),
	|	СУММА(ВсегоНоменклатурыВВиде),
	|	СУММА(Наполнение),
	|	СУММА(НаполнениеВВиде)
	|ПО
	|	ВидНоменклатуры ИЕРАРХИЯ,
	|	ТоварнаяКатегория ИЕРАРХИЯ");
	Запрос.УстановитьПараметр("ОбъектПланирования", ОбъектПланирования);
	Запрос.УстановитьПараметр("НаДату", ДатаНачалаДействия);
	Запрос.УстановитьПараметр("ПустаяКатегория", НСтр("ru = '<Категория не указана>'"));
	//
	РезультатЗапроса=Запрос.Выполнить();
	ЗаполнитьДеревоПоРезультатуЗапроса(РезультатЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоПоРезультатуЗапроса(РезультатЗапроса)
	
	ДеревоОбъект = РеквизитФормыВЗначение("ДеревоКатегорий", Тип("ДеревоЗначений"));
	ДеревоОбъект.Строки.Очистить();
	
	ДеревоРезультат = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗаполнитьПодчиненныеСтроки(ДеревоОбъект, ДеревоРезультат);
	ЗначениеВРеквизитФормы(ДеревоОбъект, "ДеревоКатегорий");
	Элементы.ДеревоКатегорий.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВерхнийУровень;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодчиненныеСтроки(тПриемник, тИсточник)
	
	Для Каждого СтрокаИсточника ИЗ тИсточник.Строки Цикл
		НужноДобавлять = Ложь;
		ВидКатегорияМарка = Неопределено;
		ЭтоИтог = Ложь;
		ИндексКартинки = 0;
		Наполнение = 0;
		ВсегоНоменклатуры = 0;
		
		ЭтоГруппаКатегорий = Истина;
		Если СтрокаИсточника.Марка <> Null Тогда
			Если ЗначениеЗаполнено(СтрокаИсточника.Марка) Тогда
				НужноДобавлять = Истина;
				ВидКатегорияМарка = СтрокаИсточника.Марка;
				ЭтоИтог = Ложь;
				ИндексКартинки = 2;
				Наполнение = СтрокаИсточника.Наполнение;
				ВсегоНоменклатуры = СтрокаИсточника.ВсегоНоменклатуры;
			КонецЕсли;
		ИначеЕсли СтрокаИсточника.ТоварнаяКатегория <> Null Тогда
			Если ЗначениеЗаполнено(СтрокаИсточника.ТоварнаяКатегория) Тогда
				НужноДобавлять = Истина;
				ВидКатегорияМарка = СтрокаИсточника.ТоварнаяКатегория;
				ЭтоИтог = Истина;
				Если СтрокаИсточника.ЭтоГруппаКатегорий = Истина ИЛИ СтрокаИсточника.ЭтоГруппаКатегорий = Null Тогда
					ИндексКартинки = 0;
				Иначе
					ИндексКартинки = 1;
					ЭтоГруппаКатегорий = Ложь;
				КонецЕсли;
				Наполнение = СтрокаИсточника.Наполнение;
				ВсегоНоменклатуры = СтрокаИсточника.ВсегоНоменклатуры;
			КонецЕсли;
		Иначе
			НужноДобавлять = Истина;
			ВидКатегорияМарка = СтрокаИсточника.ВидНоменклатуры;
			ЭтоИтог = Истина;
			ИндексКартинки = 0;
			Наполнение = СтрокаИсточника.НаполнениеВВиде;
			ВсегоНоменклатуры = СтрокаИсточника.ВсегоНоменклатурыВВиде;
		КонецЕсли;
		
		Если НужноДобавлять Тогда
			СтрокаПриемника = тПриемник.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПриемника, СтрокаИсточника);
			СтрокаПриемника.ЭтоГруппаКатегорий = ЭтоГруппаКатегорий;
			СтрокаПриемника.Наполнение = Наполнение;
			СтрокаПриемника.ВсегоНоменклатуры = ВсегоНоменклатуры;
			СтрокаПриемника.НаполнениеСУчетомПодбора = Наполнение;
			СтрокаПриемника.ВидКатегорияМарка = ВидКатегорияМарка;
			СтрокаПриемника.ЭтоИтог = ЭтоИтог;
			СтрокаПриемника.ИндексКартинки = ИндексКартинки;
			// И рекурсивно подчиненные
			ЗаполнитьПодчиненныеСтроки(СтрокаПриемника, СтрокаИсточника);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПоместитьТоварыВХранилище()
	
	втТаблицаТовары = ТаблицаВыбранныхТоваров.Выгрузить();
	
	АдресТоваровВХранилище = ПоместитьВоВременноеХранилище(втТаблицаТовары, УникальныйИдентификатор);
	СтруктураАдресов = Новый Структура;
	СтруктураАдресов.Вставить("АдресТоваровВХранилище", АдресТоваровВХранилище);
	
	Возврат СтруктураАдресов;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИнформационнуюНадписьКоличестваТоваров()
	
	ПозицииПрописью = НРег(ЧислоПрописью(ТаблицаВыбранныхТоваров.Количество(), "Л = ru_RU; ДП = Ложь; НП = Истина; НД = Ложь;", НСтр("ru = 'позиция,позиции,позиций,ж,,,,,0'")));
	ИнформационнаяНадпись = НСтр("ru = 'Всего подобрано %Позиций%.'");
	ИнформационнаяНадпись = СтрЗаменить(ИнформационнаяНадпись,"%Позиций%", ПозицииПрописью);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаполнениеСУчетомПодбораВДереве(ИдентификаторСтрокиПодобранныхТоваров, Количество)
	СтрокаПодобранныхТоваров = ТаблицаВыбранныхТоваров.НайтиПоИдентификатору(ИдентификаторСтрокиПодобранныхТоваров);
	Если СтрокаПодобранныхТоваров <> Неопределено Тогда
		Обновлять = Ложь;
		Если (СтрокаПодобранныхТоваров.СтадияАссортимента <> Перечисления.СтадииАссортимента.РазрешеныЗакупкиИПродажи 
			И СтрокаПодобранныхТоваров.СтадияАссортимента <> Перечисления.СтадииАссортимента.РазрешеныТолькоЗакупки)
			И (Операция <> Перечисления.ОперацииИзмененияАссортимента.ВыводИзАссортимента
				И Операция <> Перечисления.ОперацииИзмененияАссортимента.ПереносВАрхивОтзыв) Тогда
			// если товар был запрещен к закупке - т.е. отсутствовал в ассортименте,
			// и операция не вывода из ассортимента
			// то в результате наполненность поменяется в большую сторону
			Обновлять = Истина;
		ИначеЕсли (СтрокаПодобранныхТоваров.СтадияАссортимента = Перечисления.СтадииАссортимента.РазрешеныЗакупкиИПродажи 
			ИЛИ СтрокаПодобранныхТоваров.СтадияАссортимента = Перечисления.СтадииАссортимента.РазрешеныТолькоЗакупки)
			И (Операция = Перечисления.ОперацииИзмененияАссортимента.ВыводИзАссортимента
				ИЛИ Операция = Перечисления.ОперацииИзмененияАссортимента.ПереносВАрхивОтзыв) Тогда
			// если товар был разрешен к закупке - т.е. присутствовал в ассортименте,
			// и операция вывода из ассортимента
			// то в результате наполненность поменяется в меньшую сторону => меняем знак
			Обновлять = Истина;
			Количество = - Количество;
		КонецЕсли;
		Если Обновлять Тогда
			СтрокаДерева = НайтиСтрокуВДеревеКоллекции(ДеревоКатегорий, СтрокаПодобранныхТоваров.ТоварнаяКатегория);
			Если СтрокаДерева <> Неопределено Тогда
				СтрокаДерева.НаполнениеСУчетомПодбора = СтрокаДерева.НаполнениеСУчетомПодбора + Количество;
				СтрокаДереваСтроки = СтрокаДерева.ПолучитьЭлементы();
				Для Каждого ПодчиненнаяСтрока ИЗ СтрокаДереваСтроки  Цикл
					Если ПодчиненнаяСтрока.ВидКатегорияМарка = СтрокаПодобранныхТоваров.Марка
						ИЛИ (ПодчиненнаяСтрока.ВидКатегорияМарка = "Прочие марки" И НЕ ЗначениеЗаполнено(СтрокаПодобранныхТоваров.Марка)) Тогда
						ПодчиненнаяСтрока.НаполнениеСУчетомПодбора = ПодчиненнаяСтрока.НаполнениеСУчетомПодбора + Количество;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				ОбновитьНаполнениеСУчетомПодбораРодителейСтроки(СтрокаДерева, Количество);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаполнениеСУчетомПодбораРодителейСтроки(СтрокаДерева, Количество)
	ТекущаяСтрокаРодитель = СтрокаДерева.ПолучитьРодителя();
	Если ТекущаяСтрокаРодитель <> Неопределено Тогда
		ТекущаяСтрокаРодитель.НаполнениеСУчетомПодбора = ТекущаяСтрокаРодитель.НаполнениеСУчетомПодбора + Количество;
		ОбновитьНаполнениеСУчетомПодбораРодителейСтроки(ТекущаяСтрокаРодитель, Количество);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НайтиСтрокуВДеревеКоллекции(ДеревоКолекция, ТоварнаяКатегория)
	НайденнаяСтрока = Неопределено;
	ЭлементыКоллекции = ДеревоКолекция.ПолучитьЭлементы();
	Для Каждого ЭлементКоллекции ИЗ ЭлементыКоллекции Цикл
		Если ЭлементКоллекции.ВидКатегорияМарка = ТоварнаяКатегория Тогда
			НайденнаяСтрока = ЭлементКоллекции;
			Прервать;
		Иначе
			ЭлементКоллекцииВПодчиненных = НайтиСтрокуВДеревеКоллекции(ЭлементКоллекции, ТоварнаяКатегория);
			Если ЭлементКоллекцииВПодчиненных <> Неопределено Тогда
				НайденнаяСтрока = ЭлементКоллекцииВПодчиненных;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат НайденнаяСтрока;
КонецФункции

&НаСервере
Функция КвотаКатегории(ОбъектПланирования, ТоварнаяКатегория, МаркаОтбора, ДатаНачалаДействия)
	
	СтруктураКвоты = АссортиментСервер.СтруктураКвотыПоКатегории(ОбъектПланирования,
														 		ТоварнаяКатегория,
														 		МаркаОтбора,
														 		ДатаНачалаДействия);
	Возврат СтруктураКвоты.Квота;
	
КонецФункции
